---
kind: other
id: Methods.T:Autodesk.Revit.DB.EdgeArrayIterator
source: html/f065be07-ef2a-9b60-8afc-89d2cdae6d9e.htm
---
# EdgeArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.